
public class ReferenceDataType {

	public static void main(String[] args) {
		/* i라는 4byte크기의 정수 (기본형)타입 변수에 숫자 4를 저장한다는것을 의미 */
		int i = 4;

/*
 * 
 * - String이라는 '클래스'를 이용하여 '참조형타입' 변수 str선언
 * - 변수 앞에 기본형 타입이 아닌 String이라는 클래스가 적혀있다.  
 * - = 뒤에는 new 다음에 생성자가 있다.  
 * - new라는 키워드는 클래스를 메모리에 올리라는 뜻이다.  
 * - 메모리에 올라간 클래스를 '인스턴스'라고 한다.  
 * - 메모리에 올라간 인스턴스를 '가리키는','참조하는','reference'하는 변수 : str.
 * - 참조한다는 것은 변수가 인스턴스를 가지고 있는것이 아니라, 말 그대로 '가리킨다'는 의미
 * - str이라는 변수에는 메모리의 '위치값'이 저장된다. (그렇지만 어떤 메모리에 저장되는지 그 정보를
 * 알수 있는 방법은 없다.) 
 * 
 */
		String str = new String();
	
 /* 클래스들은 모두 참조형이다. */
	}

}
